Name: Saleh Abdallah

In [10]:
# Python and Pandas Assessment Notebook

import pandas as pd
import numpy as np
from functools import reduce

# Task 1: Create a DataFrame using Pandas
# Create a DataFrame with the following data:
# Name: Alice, Bob, Charlie, David
# Age: 25, 30, 35, 28
# City: New York, San Francisco, Los Angeles, Chicago

# Your code here:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 28],
    'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)
df

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

In [11]:
# Task 2: Row and Column Manipulation
# Drop the 'City' column from the DataFrame created in Task 1

# Your code here:
df_drop = df.drop(columns=['City'])
df_drop

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   28

In [19]:
# Task 3: Handling Null Values
# Create a new DataFrame with some null values and fill them

# Your code here:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, np.nan, 35, np.nan],
    'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)
print('Total null values: ', df.isnull().sum().sum())
# Fill null values with 0
df = df.fillna(0)
print('Total null values after update: ', df.isnull().sum().sum())

Total null values:  2
Total null values after update:  0

In [22]:
# Task 4: GroupBy and Describe
# Using the following DataFrame, group by 'Category' and describe the 'Value' column

df_group = pd.DataFrame({
    'Category': ['A', 'B', 'A', 'B', 'A', 'C'],
    'Value': [10, 20, 15, 25, 30, 35]
})

# Your code here:
df_group.groupby('Category')['Value'].describe().round(1)

          count  mean   std   min   25%   50%   75%   max
Category
A           3.0  18.3  10.4  10.0  12.5  15.0  22.5  30.0
B           2.0  22.5   3.5  20.0  21.2  22.5  23.8  25.0
C           1.0  35.0   NaN  35.0  35.0  35.0  35.0  35.0

In [81]:
# Task 5: Concatenation and Merging
# Concatenate two DataFrames vertically and merge them horizontally

df1 = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})
df2 = pd.DataFrame({'A': [5, 6], 'B': [7, 8]})
df3 = pd.DataFrame({'C': [9, 10], 'D': [11, 12]})

# Your code here:
df_concat = pd.concat([df1, df2], ignore_index=True)
print('Vertical concatenation of df1 and df2:\n', df_concat)
df_merge = pd.concat([df_concat, df3], axis=1)
print('\nHorizontal merging of the concatenation result with df3:\n', df_merge)

Vertical concatenation of df1 and df2:
    A  B
0  1  3
1  2  4
2  5  7
3  6  8

Horizontal merging of the concatenation result with df3:
    A  B     C     D
0  1  3   9.0  11.0
1  2  4  10.0  12.0
2  5  7   NaN   NaN
3  6  8   NaN   NaN

In [42]:
# Task 6: Tuples and Sets
# Create a tuple of fruits and a set of numbers.
# Then, try to add an element to each and observe the difference.

# Your code here:
fruits = ('apple', 'banana', 'cherry')
numbers = {1, 2, 3, 4, 5}

# Unlike lists and sets tuples are immutable but we can create a new tuple 
# by concatenating the existing 'fruits' tuple with the new value tuple
fruits += ('orange',)  
print('Updated fruits:', fruits)
numbers.add(6)
print('Updated numbers:', numbers)

Updated fruits: ('apple', 'banana', 'cherry', 'orange')
Updated numbers: {1, 2, 3, 4, 5, 6}

In [33]:
# Task 7: Dictionaries
# Create a dictionary of student names and their scores.
# Then, update a student's score and add a new student.

# Your code here:
scores = {'Alice': 88, 'Bob': 92, 'Charlie': 85}
scores['Bob'] = 95  
scores['David'] = 90 
scores

{'Alice': 88, 'Bob': 95, 'Charlie': 85, 'David': 90}

In [79]:
# Task 8: Functions and Lambda
# Create a function to calculate the square of a number.
# Then, use a lambda function to do the same.

# Your code here:
def square(x):
    return x * x

lambda_square = lambda x: x * x

print('Square function:', square(6))
print('Square function using Lambda:', lambda_square(6))

Square function: 36
Square function using Lambda: 36

In [ ]:
# Task 9: Iterators and Generators
# Create an iterator for the first 5 even numbers.
# Then, create a generator for the same.

# Your code here:

In [78]:
# Task 10: Map, Reduce, and Filter
# Use map to square all numbers in a list.
# Use reduce to find the product of all numbers in a list.
# Use filter to get only even numbers from a list.

# Your code here:
nums = np.arange(1, 7)
square = list(map(lambda_square, nums))
product = reduce(lambda x, y: x * y, nums)
even = list(filter(lambda x: x % 2 == 0, nums))

print('Numbers list:', nums)
print('Numbers list square:', square)
print('Numbers list product:', product)
print('Numbers list even numbers:', even)

Numbers list: [1 2 3 4 5 6]
Numbers list square: [1, 4, 9, 16, 25, 36]
Numbers list product: 720
Numbers list even numbers: [2, 4, 6]

In [74]:
# Task 11: Object-Oriented Programming - Creating a Class
# Create a class called 'Rectangle' with attributes 'length' and 'width'.
# Include methods to calculate area and perimeter.

# Your code here:
# Define the Rectangle class
class Rectangle:
    def __init__(self, length, width):
        self.length = length
        self.width = width
    
    def sides(self):
        return f'Length = {self.length} and Width = {self.width}'

    def area(self):
        return self.length * self.width

    def perimeter(self):
        return 2 * (self.length + self.width)

rectangle = Rectangle(5, 9)
print('The sides of the rectangle are:', rectangle.sides())
print('The Area of the rectangle is:', rectangle.area())
print('The Perimeter of the rectangle is:', rectangle.perimeter())

The sides of the rectangle are: Length = 5 and Width = 9
The Area of the rectangle is: 45
The Perimeter of the rectangle is: 28

In [73]:
# Task 12: Pandas Data Analysis
# Using the following DataFrame, perform these tasks:
# 1. Find the average salary by department
# 2. Get the names of employees with salary > 60000
# 3. Add a new column 'Bonus' which is 10% of salary

df_employees = pd.DataFrame({
    'Name': ['John', 'Jane', 'Bob', 'Alice', 'Charlie'],
    'Department': ['IT', 'HR', 'IT', 'Finance', 'HR'],
    'Salary': [55000, 65000, 70000, 60000, 58000]
})

# Your code here:
avg_salary = df_employees.groupby('Department')['Salary'].mean()
above_60 = df_employees[df_employees['Salary'] > 60000][['Name','Salary']]
df_employees['Bonus'] = df_employees['Salary'] * 0.1

print('Average salary by department:\n', avg_salary)
print('\nEmployees with salary above 60000:\n', above_60)
print('\nDF after adding 10% bonus column:\n', df_employees)

Average salary by department:
 Department
Finance    60000.0
HR         61500.0
IT         62500.0
Name: Salary, dtype: float64

Employees with salary above 60000:
    Name  Salary
1  Jane   65000
2   Bob   70000

DF after adding 10% bonus column:
       Name Department  Salary   Bonus
0     John         IT   55000  5500.0
1     Jane         HR   65000  6500.0
2      Bob         IT   70000  7000.0
3    Alice    Finance   60000  6000.0
4  Charlie         HR   58000  5800.0